<?php
/**
===================================
Файл: db.php
-----------------------------------------------------
Версия: 1.0v
-----------------------------------------------------
Назначение: Подключение к БД
-----------------------------------------------------
===================================
**/

if (! defined ( 'WEB_MODER' )) {
	die ( "<P>Доступ к файлу заблокирован!<P>Возможно вы пытаетесь запустить его на прямую" );
}

define('HOST','localhost'); //Сервер баз данных
define('USER','vebtehnolo_j'); //Имя пользователя
define('PASS','qwer3214'); //Пароль
define('DB_NAME','vebtehnolo_j'); //Имя базы данных

mysql_connect(HOST , USER , PASS) or die ("<H1>Не удалось подключиться к серверу баз данных!</H1>");

mysql_select_db(DB_NAME) or die ("<H1>Не удалось подключиться к базе данных ". DB_NAME ." !</H1>");
mysql_set_charset ("cp1251");
?>